caninos-loucos/ArduinoCore-zephyr/boards.txt
niclasense.upload.maximum_size=786432
niclasense.upload.maximum_data_size=523624

#niclasense.bootloader.tool=openocd
#niclasense.bootloader.tool.default=openocd
niclasense.bootloader.tool=pyocd
niclasense.bootloader.tool.default=pyocd
niclasense.bootloader.vid=0x2341
niclasense.bootloader.pid=0x0360
niclasense.bootloader.interface=0
niclasense.bootloader.file=zephyr-{build.variant}.hex
niclasense.bootloader.target=nrf52

niclasense.debug.tool=gdb
niclasense.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
niclasense.debug.server.openocd.scripts.1={programmer.transport_script}
niclasense.debug.server.openocd.scripts.2=target/nrf52.cfg
niclasense.debug.cortex-debug.custom.request=attach


##########################################################################################

portentac33.name=Portenta C33
portentac33.build.core=arduino
portentac33.build.crossprefix=arm-zephyr-eabi-
portentac33.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

portentac33.menu.debug.false=Standard
portentac33.menu.debug.true=Debug
portentac33.menu.debug.true.build.zsk_args.debug=-debug

portentac33.menu.link_mode.dynamic=Dynamic
portentac33.menu.link_mode.static=Static
portentac33.menu.link_mode.static.build.link_mode=static
portentac33.menu.link_mode.static.upload.extension=bin-zsk.bin

portentac33.build.zephyr_target=arduino_portenta_c33
portentac33.build.zephyr_args=
portentac33.build.zephyr_hals=hal_renesas nanopb
portentac33.build.variant=arduino_portenta_c33_r7fa6m5bh3cfc
portentac33.build.mcu=cortex-m33
portentac33.build.fpu=-mfpu=fpv5-sp-d16
portentac33.build.architecture=cortex-m33

portentac33.build.float-abi=-mfloat-abi=hard
portentac33.build.extra_flags=
portentac33.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
portentac33.build.board=ARDUINO_PORTENTA_C33
portentac33.vid.0=0x2341
portentac33.pid.0=0x0068
portentac33.upload_port.0.vid=0x2341
portentac33.upload_port.0.pid=0x0068
portentac33.upload.target=portentac33

portentac33.upload.tool=dfu-util
portentac33.upload.tool.default=dfu-util
portentac33.upload.protocol=
portentac33.upload.transport=
portentac33.upload.vid=0x2341
portentac33.upload.pid=0x0368
portentac33.upload.interface=1
portentac33.upload.use_1200bps_touch=true
portentac33.upload.wait_for_upload_port=false
portentac33.upload.native_usb=true
portentac33.upload.maximum_size=1966080
portentac33.upload.maximum_data_size=523624
portentac33.upload.address=0x100000
portentac33.upload.dfuse=-Q

portentac33.bootloader.tool=dfu-util
portentac33.bootloader.tool.default=dfu-util
portentac33.bootloader.file=zephyr-{build.variant}.bin
portentac33.bootloader.interface=0
portentac33.bootloader.address=0x10000
portentac33.bootloader.dfuse=-Q

##########################################################################################

opta.name=Arduino Opta
opta.build.core=arduino
opta.build.crossprefix=arm-zephyr-eabi-
opta.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

opta.menu.debug.false=Standard
opta.menu.debug.true=Debug
opta.menu.debug.true.build.zsk_args.debug=-debug

opta.build.zephyr_target=arduino_opta//m7
opta.build.zephyr_args=
opta.build.zephyr_hals=hal_stm32 hal_infineon
opta.build.variant=arduino_opta_stm32h747xx_m7
opta.build.mcu=cortex-m7
opta.build.fpu=-mfpu=fpv5-d16
opta.build.architecture=cortex-m7

opta.build.float-abi=-mfloat-abi=softfp
opta.build.extra_flags=
opta.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
opta.build.architecture=cortex-m7
opta.build.board=ARDUINO_OPTA
opta.vid.0=0x2341
opta.pid.0=0x0064
opta.upload_port.0.vid=0x2341
opta.upload_port.0.pid=0x0364

opta.upload.tool=dfu-util
opta.upload.tool.default=dfu-util
opta.upload.protocol=
opta.upload.transport=
opta.upload.vid=0x2341
opta.upload.pid=0x0364
opta.upload.interface=0
opta.upload.use_1200bps_touch=true
opta.upload.wait_for_upload_port=true
opta.upload.native_usb=true
opta.upload.maximum_size=1966080
opta.upload.maximum_data_size=523624

opta.upload.address=0x080E0000

opta.upload.maximum_size=786432
opta.upload.maximum_data_size=523624

opta.bootloader.tool=dfu-util
opta.bootloader.tool.default=dfu-util
opta.bootloader.vid=0x2341
opta.bootloader.pid=0x0364
opta.bootloader.interface=0
opta.bootloader.file=zephyr-{build.variant}.bin
opta.bootloader.address=0x08040000

opta.debug.tool=gdb
opta.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
opta.debug.server.openocd.scripts.1={programmer.transport_script}
opta.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
opta.debug.cortex-debug.custom.request=attach
opta.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##############################################################################################################

puppy.name=puppy-testboard
puppy.build.core=arduino
puppy.build.board=puppy-testboard
puppy.build.zephyr_target=puppy-testboard
puppy.build.variant=puppy-testboard_puppy_v1

puppy.build.crossprefix=riscv64-zephyr-elf-
puppy.build.compiler_path=/home/ana/zephyr-sdk-0.16.8/riscv64-zephyr-elf/bin/
puppy.compiler.zephyr=
puppy.compiler.zephyr.arch.define=-DRV_ISA_RV32
puppy.runtime.tools.zephyr-sketch-tool.path=/home/ana/arduino-puppy/ArduinoCore-zephyr/extra/zephyr-sketch-tool

puppy.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
puppy.build.architecture=rv32im_zicsr
puppy.build.mcu=rv32im_zicsr

puppy.upload.address=0xf1000
puppy.upload.maximum_size=32768

puppy.bootloader.tool=dfu-util
puppy.bootloader.tool.default=dfu-util
puppy.bootloader.vid=0x2341
puppy.bootloader.pid=0x0364
puppy.bootloader.interface=0
puppy.bootloader.file=zephyr-{build.variant}.bin
puppy.bootloader.address=0x11000

##############################################################################################################

poodleino.name=poodleino-toy-v1
poodleino.build.core=arduino
poodleino.build.board=poodleino-toy-v1
poodleino.build.zephyr_target=poodleino-toy-v1
poodleino.build.variant=poodleino-toy-v1_puppy_v2

poodleino.build.crossprefix=riscv64-zephyr-elf-
poodleino.build.compiler_path=/home/ana/zephyr-sdk-0.16.8/riscv64-zephyr-elf/bin/
poodleino.compiler.zephyr=
poodleino.runtime.tools.zephyr-sketch-tool.path=/home/ana/arduino-puppy/ArduinoCore-zephyr/extra/zephyr-sketch-tool

poodleino.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
poodleino.build.architecture=rv32imafc_zicsr
poodleino.build.mcu=rv32imafc_zicsr
poodleino.build.abi=ilp32

poodleino.upload.address=0xe1000
poodleino.upload.maximum_size=32768

poodleino.bootloader.tool=dfu-util
poodleino.bootloader.tool.default=dfu-util
poodleino.bootloader.vid=0x2341
poodleino.bootloader.pid=0x0364
poodleino.bootloader.interface=0
poodleino.bootloader.file=zephyr-{build.variant}.bin
poodleino.bootloader.address=0x11000
